service/src/intTest/resources/illogicalmessage/RCMR_IN010000UK05_ebxml.txt

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0"><soap:Header><eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1"><eb:From><eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">N82668-820670</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">B86041-822103</eb:PartyId></eb:To><eb:CPAId>1b09c9557a7794ff6fd2</eb:CPAId><eb:ConversationId>%%ConversationId%%</eb:ConversationId><eb:Service>urn:nhs:names:services:gp2gp</eb:Service><eb:Action>RCMR_IN010000UK05</eb:Action><eb:MessageData><eb:MessageId>DFF5321C-C6EA-468E-BBC2-B0E48000E071</eb:MessageId><eb:Timestamp>2020-11-16T17:13:38.682Z</eb:Timestamp><eb:TimeToLive>2020-11-16T23:28:38.682Z</eb:TimeToLive></eb:MessageData><eb:DuplicateElimination /></eb:MessageHeader><eb:AckRequested eb:version="2.0" soap:mustUnderstand="1" soap:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH" eb:signed="false" /></soap:Header><soap:Body><eb:Manifest eb:version="2.0" soap:mustUnderstand="1"><eb:Reference xmlns:xlink="http://www.w3.org/1999/xlink" xlink:href="cid:Content1@e-mis.com/EMISWeb/GP2GP2.2A"><eb:Description xml:lang="en">RCMR_IN010000UK05</eb:Description><hl7ebxml:Payload style="HL7" encoding="XML" version="3.0" /></eb:Reference></eb:Manifest></soap:Body></soap:Envelope>